package test0624_02;

public class AdminAccDao {
	// 1. 관리자 로그인
	//클래스 AppMain에서 3. 관리자 로그인.  메소드 호출 - 42번 줄 -> 관리자 로그인 페이지로 전환
	
	//1-2. 아이디와 비밀번호 입력 후 맞고 틀린 경우 체크되고 로그인 되었으면 관리자 모드로 넘어가기. (코드 변경 없음)
	
	//2. 관리자 모드에서 관리자 정보보기와 관리자 비밀번호 재설정
	//2-1 관리자 정보보기
	//클래스 AdminPage에서 4. 관리자 설정 메뉴추가하기 & 메소드 호출 20번줄, 
	
	//점포 정보 조회 메소드 만들기 - Member 클래스에다가 생성자 추가 (39번 줄)
//						   - 218번 줄 메소드 추가 ㅡMemberdao에다가
//						   - 293번 줄 메소드 추가 - MemberManager에다가
	
	//관리자 비밀번호 설정 메소드 만들기. - Member 클래스에 생성자 추가 (44번 줄)
//	                            - 
	
	
	
}
